Revit 2025 API
EnergyModelType Enumeration
 This enum is used to define if the energy model is based on rooms/spaces, building elements or analysis mode in EnergyDataSettings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum EnergyModelType
Public Enumeration EnergyModelType
public enum class EnergyModelType
type EnergyModelType
Members
Member name | Value | Description
SpatialElement | 0 |  Energy model based on rooms or spaces.
BuildingElement | 1 |  The building element based energy analytical model.
AnalysisMode | 2 |  Energy model based on analysis mode in EnergyDataSettings.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace